pitzDaily/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1000;

vertices
(
    (-0.6 -0.6 0.1) //0
    (0.6 -0.6 0.1) //1
    (0.6 0.6 0.1)//2
    (-0.6 0.6 0.1)//3
    //(-0.6 -0.6 0.1)//4
    (-0.6 -0.6 2.5) //5
    (0.6 -0.6 2.5) //6
    (0.6 0.6 2.5)//7
    (-0.6 0.6 2.5)//8



);

blocks
(
    hex (0 1 2 3 4 5 6 7 ) (10 10 10) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    // inlet
    // {
    //     type patch;
    //     faces
    //     (
    //         (0 22 23 1)
    //         (1 23 24 2)
    //         (2 24 25 3)
    //     );
    // }
    // outlet
    // {
    //     type patch;
    //     faces
    //     (
    //         (16 17 39 38)
    //         (17 18 40 39)
    //         (18 19 41 40)
    //         (19 20 42 41)
    //         (20 21 43 42)
    //     );
    // }
    // upperWall
    // {
    //     type wall;
    //     faces
    //     (
    //         (3 25 31 9)
    //         (9 31 37 15)
    //         (15 37 43 21)
    //     );
    // }
    // lowerWall
    // {
    //     type wall;
    //     faces
    //     (
    //         (0 6 28 22)
    //         (6 5 27 28)
    //         (5 4 26 27)
    //         (4 10 32 26)
    //         (10 16 38 32)
    //     );
    // }
    // frontAndBack
    // {
    //     type empty;
    //     faces
    //     (
    //         (22 28 29 23)
    //         (23 29 30 24)
    //         (24 30 31 25)
    //         (26 32 33 27)
    //         (27 33 34 28)
    //         (28 34 35 29)
    //         (29 35 36 30)
    //         (30 36 37 31)
    //         (32 38 39 33)
    //         (33 39 40 34)
    //         (34 40 41 35)
    //         (35 41 42 36)
    //         (36 42 43 37)
    //         (0 1 7 6)
    //         (1 2 8 7)
    //         (2 3 9 8)
    //         (4 5 11 10)
    //         (5 6 12 11)
    //         (6 7 13 12)
    //         (7 8 14 13)
    //         (8 9 15 14)
    //         (10 11 17 16)
    //         (11 12 18 17)
    //         (12 13 19 18)
    //         (13 14 20 19)
    //         (14 15 21 20)
    //     );
    // }
);

mergePatchPairs
(
);

// ************************************************************************* //
